**Imports and workspace setting**

In [2]:
import csv
import math
import os

import numpy as np
import pandas as pd
import seaborn as sns
import scipy.stats as stat

import matplotlib.mlab as mlab
import matplotlib.pyplot as plt
%matplotlib inline

**Loading crime-data and preview**

In [144]:
crime_data = pd.read_csv('../data/Crime_data_2012.csv')

crime_data = crime_data.T

#column_names = crime_data.iloc[[0]]
crime_data = crime_data.iloc[1:]
crime_data = crime_data.sort_index()
#crime_data.columns=column_names
crime_data.to_csv('out.csv')
crime_data = pd.read_csv('out.csv')

print("Data set size : ", crime_data.shape)
crime_data.head()

Data set size :  (25, 23)

,Unnamed: 0,0,1,2,3,4,5,6,7,8,...,12,13,14,15,16,17,18,19,20,21
0,Ampara,29,31,36,239,69,38,16,12,37,...,2,232,242,1,0,1,2,1,0,1
1,Anuradhapura,68,47,107,834,108,72,24,15,199,...,9,270,584,6,0,23,2,4,1,7
2,Badulla (Badfulla & Bandarawela ),38,14,42,359,112,85,28,11,73,...,1,138,296,1,0,2,0,3,0,20
3,Batticaloa,21,33,38,227,56,89,11,2,52,...,4,225,221,1,0,6,3,1,1,3
4,"Colombo (Colombo South, North, Central) Mt. La...",154,22,140,2996,248,379,62,21,120,...,37,1736,2809,4,0,52,1,21,6,573

**Loading Employment by Industrical sector**

In [143]:
emplyment_data = pd.read_csv('../data/Employees by industrial sector (% to total employment).csv')
emplyment_data = emplyment_data.sort_values(by = ['District'])
emplyment_data = emplyment_data.reset_index(drop=True)
emplyment_data.head()

,Province,District,Male emp. Agriculture,Male emp. Industry,Male emp. Services,Total,Female emp. Agriculture,Female emp. Industry,Female emp. Services,Female emp. Total,Total emp. Agriculture,Total emp. Industry,Total emp. Services,Total employment
0,Eastern,Ampara,13.8,19.0,26.9,59.7,1.8,4.1,44.7,50.6,11.3,15.9,30.6,57.8
1,North Central,Aqnuradhapura,3.7,6.0,27.0,36.7,1.7,5.5,18.0,25.2,2.9,5.8,23.5,32.2
2,Uva,Badulla,17.0,9.9,21.5,48.4,23.7,4.8,17.3,45.8,19.6,7.9,19.9,47.4
3,Eastern,Batticaloa,20.9,18.1,26.0,64.9,2.1,4.0,33.2,39.3,16.6,14.8,27.6,59.0
4,Western,Colombo,1.1,20.6,42.9,64.7,1.3,20.0,50.5,71.7,1.2,20.4,45.4,67.0

In [135]:
print('Data set size = ', emplyment_data.shape)
print('Dimension = ', emplyment_data.ndim)

Data set size =  (25, 14)
Dimension =  2

**Loading Accomadation for tourist data**

In [12]:
hotels_data = pd.read_csv('../data/Information for Accommodation.csv')
hotels_data.head()

,Type,Name,Address,Rooms,Grade,District,AGA Division,PS/MC/UC,Logitiute,Latitude
0,Boutique Hotels,THE THEVA RESIDENCY,"11/B5/10-1 06TH LANE, HANTANA,KANDY",10,NaN,Kandy,Kandy Divisional Secretariat,Kandy,80.635411,7.276036
1,Boutique Hotels,HIGHLAND VILLA,"351, ABIMANGAMA ROAD, KUMBALGAMA, WELIGAMA",10,NaN,Matara,Weligama Divisional Secretariat,Weligama Pradeshiya Sabha,80.409972,5.960334
2,Boutique Hotels,ULAGALLA WALAWWA RESORT,"THIRAPPANE, ANURADHAPURA",21,NaN,Anuradhapura,Anuradhapura East,Anuradhapura,80.545063,8.205927
3,Boutique Hotels,GALLE FORT HOTEL,"NO.28, CHURCH STREET, FORT , GALLE",14,NaN,Galle,Galle Divisional Secretariat,Galle,80.217563,6.026649
4,Boutique Hotels,THE ELEPHANT CORRIDOR,"POTHANA,KIBISSA, SIGIRIYA",21,NaN,Matale,NaN,Matale,80.710743,7.943525

In [13]:
print('Data set size = ', hotels_data.shape)
print('Dimension = ', hotels_data.ndim)

Data set size =  (2130, 10)
Dimension =  2

**Drill Down accomadation data by district**

In [18]:
## This array will become 26*10 afterwards

**Merge all 4 datasets in to one pandas frame**

In [146]:

result = pd.concat([crime_data, emplyment_data], axis=1)
result.head()

,Unnamed: 0,0,1,2,3,4,5,6,7,8,...,Male emp. Services,Total,Female emp. Agriculture,Female emp. Industry,Female emp. Services,Female emp. Total,Total emp. Agriculture,Total emp. Industry,Total emp. Services,Total employment
0,Ampara,29,31,36,239,69,38,16,12,37,...,26.9,59.7,1.8,4.1,44.7,50.6,11.3,15.9,30.6,57.8
1,Anuradhapura,68,47,107,834,108,72,24,15,199,...,27.0,36.7,1.7,5.5,18.0,25.2,2.9,5.8,23.5,32.2
2,Badulla (Badfulla & Bandarawela ),38,14,42,359,112,85,28,11,73,...,21.5,48.4,23.7,4.8,17.3,45.8,19.6,7.9,19.9,47.4
3,Batticaloa,21,33,38,227,56,89,11,2,52,...,26.0,64.9,2.1,4.0,33.2,39.3,16.6,14.8,27.6,59.0
4,"Colombo (Colombo South, North, Central) Mt. La...",154,22,140,2996,248,379,62,21,120,...,42.9,64.7,1.3,20.0,50.5,71.7,1.2,20.4,45.4,67.0

**Correlation analysis**

**Stating independent/ dependent variables**

**Divide training and testing data-set**

In [15]:
## 20 districts for training
## 6 for training
## Or some other experimenting methods would be okay.

**Model training - possibly regression/ classification**

In [17]:
## If it is classification we need to pick a label column.

**Testing the model**